{
    "internship": "Subject: Application for Internship Opportunity\n\nDear [Recipient's Name],\n\nI hope this message finds you well. I am writing to express my keen interest in pursuing an internship at [Company Name]. I am currently enrolled in [Your Course] at [Your Institute], and I am eager to gain practical experience and contribute to your esteemed organization.\n\nI have a strong interest in [Field/Area of Interest] and believe that an internship at your company will provide me with valuable exposure and learning opportunities.\n\nThank you for considering my request. I have attached my resume for your review. I look forward to the opportunity to discuss this further.\n\nWarm regards,\n[Your Full Name]\n[Your Contact Info]",
  
    "leave": "Subject: Request for Leave\n\nDear [Recipient's Name],\n\nI hope you are doing well. I am writing to formally request leave from [Start Date] to [End Date] due to [Reason - e.g., personal commitments/medical reasons/family emergency].\n\nPlease let me know if any further information is required or if I need to complete any formalities before my leave. I will ensure all my responsibilities are handled before my absence.\n\nThank you for your understanding and support.\n\nSincerely,\n[Your Full Name]\n[Your Designation/Role (if applicable)]",
  
    "resignation": "Subject: Formal Resignation Letter\n\nDear [Manager's Name],\n\nI hope you are doing well. I am writing to formally resign from my position as [Your Position] at [Company Name], with my last working day being [Last Working Date], in accordance with the notice period.\n\nThis decision was not easy and took considerable thought. I have enjoyed working at [Company Name] and am grateful for the support and opportunities provided. I am committed to ensuring a smooth transition of my responsibilities.\n\nThank you once again for the experience and professional growth.\n\nBest regards,\n[Your Full Name]\n[Your Contact Info]",
  
    "job application": "Subject: Application for [Job Title] Position\n\nDear [Hiring Manager's Name],\n\nI am writing to express my interest in the [Job Title] position at [Company Name] as advertised. I believe that my background in [Relevant Skills/Field] and my experience in [Previous Role or Projects] make me a strong candidate for this role.\n\nI am passionate about [Relevant Topic or Field] and am confident in my ability to contribute to your team’s success. Please find my resume attached for your consideration.\n\nI look forward to the opportunity to discuss how I can be a valuable addition to your organization.\n\nSincerely,\n[Your Full Name]\n[Your Contact Info]"
  }
  
